[
    {
        "ID": "001",
        "Gender": "female",
        "Name": "Mary Jones",
        "Age": 29,
        "Date_of_birth": "1994-06-27",
        "Photo": "NULL",
        "Occupation": "forestry worker",
        "Traits": "- I am a fan of extreme sports. - I like throwing parties and inviting all my friends. - I can tell someone's emotions by looking at their face. - I have had many partners and tend to fall in love easily. - My focus on logic sometimes makes me appear detached or overly critical to others. - I have a strong personal logic and set of beliefs. - I have clear goals that I am dedicated to. - It takes time for me to consider someone a friend. - My emotions are sometimes kept inside, especially if I am unsure about them. - I can be introspective, though not always. - Social experiments intrigue me, but I do not engage in them often. - My decisions are often influenced by intuition. - Punctuality for school was not my strong suit. - My ideas are usually conventional. - I seldom imagine being in different realities. - New ideas often seem impractical to me. - Comforting others is difficult and often avoided. - I find collaborative work unenjoyable and prefer solitude. - I lack empathy for animals used in experiments. - I do not place much value on forming close relationships. ",
        "Hobbies": "gardening, rock climbing, birdwatching",
        "Family": "low-income, nuclear family",
        "Education": "have not attended any formal schooling",
        "Short-term_goals": "volunteering, spending quality time with loved ones, adopting a balanced diet",
        "Long-term_goal": "buying a home"
    },
    {
        "ID": "002",
        "Gender": "female",
        "Name": "Sara Ochoa",
        "Age": 44,
        "Date_of_birth": "1979-09-11",
        "Photo": "NULL",
        "Occupation": "metal processing operator",
        "Traits": "- My unique ideas were born from inspiration. - My friends say I am a philosopher. - I like something that has a symbolic meaning. - Others always think I am contemplating. - I prefer to rely on my own logical reasoning rather than following popular opinions. - My focus on logic sometimes makes me appear detached or overly critical to others. - When faced with opportunities, I emphasize fairness and reasonableness over compassion. - I often use examples to illustrate my points. - I defend my opinions and sometimes challenge others’ views. - During disagreements, I try to smooth things over. - Sometimes beautiful landscapes can evoke a sense of romance in me. - I rarely fantasize about unreal scenarios. - I am cautious about new ideas and often stick to what I know and have experienced. - Sensory experiences like horror movies or roller coasters do not attract me. - Romantic rituals seem unnecessary to me. - The opinions of others about my appearance do not concern me much. - I often find myself stereotyping, despite efforts to avoid it. - I rarely schedule my daily activities. - My memory of nostalgic events is not particularly strong. - I am drawn to highly active and social environments like competitive team sports or large parties.",
        "Hobbies": "watching movies, camping, swimming",
        "Family": "low-income, blended family",
        "Education": "have completed high school",
        "Short-term_goals": "taking time for hobbies, learning a new skill related to the job, spending quality time with loved ones",
        "Long-term_goal": "saving enough to retire comfortably"
    },
    {
        "ID": "003",
        "Gender": "female",
        "Name": "Tami Clark",
        "Age": 53,
        "Date_of_birth": "1970-08-18",
        "Photo": "NULL",
        "Occupation": "chef",
        "Traits": "- I can tell someone's emotions by looking at their face. - I have had many partners and tend to fall in love easily. - I value material pleasures and enjoy sharing these feelings with others. - Sometimes I’m indulging in dating. - I am selective about making friends and value deep connections. - I prioritize my emotional well-being and try to stay comfortable. - My beliefs are strong, and I am seen as principled. - I get restless with routine work. - New perspectives are interesting to me. - When making decisions, I consider both compassion and fairness. - hunches are right about half the time. - My attempts at humor do not always lift the mood. - Social rules are somewhat important, but I do not always follow them. - I get easily influenced in debates. - I seldom take the lead in group discussions. - I struggle with using examples effectively. - I was frequently late for school. - My memory of nostalgic events is not particularly strong. - People often find me disorganized. - I almost entirely rely on intuition in my actions, rarely considering past experiences or established methods.",
        "Hobbies": "listening to music, gymnastics, boating",
        "Family": "middle-income, extended family",
        "Education": "have attended college but have not earned a degree",
        "Short-term_goals": "planning short trips or outings, paying down debt, building relationships with superiors",
        "Long-term_goal": "traveling to new countries"
    },
{
        "ID": "004",
        "Gender": "male",
        "Name": "Michael Miller",
        "Age": 25,
        "Date_of_birth": "1998-07-09",
        "Photo": "NULL",
        "Occupation": "tourist guide",
        "Traits": "- Fearing to hurt others' feelings, I often conceal my thoughts and refrain from persuading others. - Listening to a concert brings me peace and harmony. - I do not enjoy teaching or explaining things to others. - I have a good memory because I am nostalgic. - I heavily rely on past experiences. - I usually order the same meal for lunch. - I often wonder how others perceive me. - I maintain an idealistic view of the world. - I am selective about making friends and value deep connections. - I try to mediate during arguments to bring about peace. - I have a good sense of humor and can make social gatherings enjoyable. - Some of my ideas are innovative. - I can focus well, though I am occasionally distracted. - Symbolism in art and literature is often lost on me. - I seldom indulge in self-reflection regarding my thoughts and emotions. - I am indifferent to material pleasures. - I rarely engage in dating. - I avoid adventure sports and similar activities. - In chaotic or unstable environments, I often feel lost and overwhelmed. - I avoid taking the lead in discussions.",
        "Hobbies": "photography, gardening, running",
        "Family": "low-income, single-parent family",
        "Education": "have earned a bachelor's degree",
        "Short-term_goals": "creating a daily schedule, completing minor home improvement projects, joining professional organizations",
        "Long-term_goal": "engaging in regular volunteer work"
    },
    {
        "ID": "005",
        "Gender": "female",
        "Name": "Haley Collins",
        "Age": 46,
        "Date_of_birth": "1977-09-21",
        "Photo": "NULL",
        "Occupation": "electrical equipment repairer",
        "Traits": "- I usually order the same meal for lunch. - I make a schedule for everyday tasks. - I have a good memory because I am nostalgic. - I enjoy relaxing activities that allow for solitary immersion. - Teaching and sharing knowledge is something I find fulfilling. - I have a strong desire to make things more logical and efficient. - In debates, I am able to maintain focus and point out flaws in arguments. - I get restless with routine work. - The unknown aspects of space intrigue me. - I can be perceived as somewhat critical, though I try to balance logic with emotion. - I am cautious about surprises and tend to favor situations where I am informed. - I try to comfort people, but I am not always sure what to say. - I sometimes voice opinions that might upset others. - Visuals do not convey much meaning to me. - I usually overlook deeper meanings. - I prefer stories with clear endings. - My feelings often take a backseat to more immediate concerns. - I easily form friendships and sometimes too hastily accept new friends. - I rarely think about how others see me. - Being a listener is challenging, and I am not effective at it.",
        "Hobbies": "playing football, astronomy, singing",
        "Family": "middle-income, single-parent family",
        "Education": "have earned a professional degree",
        "Short-term_goals": "practicing relaxation techniques like meditation or yoga, supporting local businesses and events, volunteering",
        "Long-term_goal": "taking on a leadership role in community organizations"
    },
    {
        "ID": "006",
        "Gender": "male",
        "Name": "James Jones",
        "Age": 35,
        "Date_of_birth": "1988-09-13",
        "Photo": "NULL",
        "Occupation": "van driver",
        "Traits": "- I often hide my feelings due to shyness or uncertainty. - In emergency situations, I struggle with organizing my thoughts and can quickly become overwhelmed. - Although there is a routine, I am eager to explore a new way. - I am bored of repetitive work. - I have an imaginary world in my brain. - People think I am a weirdo because my thoughts are too jumpy. - I empathize with my friends' problems. - I often wonder how others perceive me. - I feel sympathy for animals used in research. - I have a good sense of humor and can make social gatherings enjoyable. - Some friends think I have philosophical tendencies. - Mildly adventurous activities are sometimes interesting. - I have goals but they are not always clear or strong. - I am not always open to viewpoints that differ from mine. - I seldom take the lead in group discussions. - I get easily influenced in debates. - As a child, self-discipline and rule-following were not my strengths. - Music and concerts do not bring me harmony. - I almost entirely rely on intuition in my actions, rarely considering past experiences or established methods. - I often find myself stereotyping, despite efforts to avoid it.",
        "Hobbies": "fishing, watching movies, horseback riding",
        "Family": "low-income, nuclear family",
        "Education": "have completed high school",
        "Short-term_goals": "engaging in regular exercise, implementing a new time management strategy, saving a certain amount of money",
        "Long-term_goal": "paying off the mortgage"
    },
{
        "ID": "007",
        "Gender": "male",
        "Name": "Kevin Kelly",
        "Age": 36,
        "Date_of_birth": "1988-05-29",
        "Photo": "NULL",
        "Occupation": "software developer",
        "Traits": "- I have a good memory because I am nostalgic. - I usually order the same meal for lunch. - I heavily rely on past experiences. - As a child, I was self-disciplined and always adhered to the school rules. - I have clear goals that I am dedicated to. - I am highly analytical, and often lost in my thoughts, which makes me appear distant to others. - When faced with opportunities, I emphasize fairness and reasonableness over compassion. - I might think some people miss the bigger picture. - I am known for being reflective. - Repetition can be tiresome. - I appreciate a sense of community, though I am fine on my own too. - I have opinions but do not often confront others' views. - I find it hard to take control in chaotic situations. - My idealism is limited, and I lean more towards pragmatism. - Defining meaning in life is a challenge for me. - Romantic associations with landscapes are infrequent for me. - Dating and romantic relationships are not priorities for me. - I am indifferent to others' perceptions of my appearance. - I am almost entirely uninterested in material pleasures. - I do not believe in the significance of rituals in love.",
        "Hobbies": "reading, yoga, metalworking",
        "Family": "low-income, blended family",
        "Education": "have earned a bachelor's degree",
        "Short-term_goals": "learning a new skill related to the job, completing minor home improvement projects, planning short trips or outings",
        "Long-term_goal": "earning a promotion"
    },
{
        "ID": "008",
        "Gender": "female",
        "Name": "Erica Walker",
        "Age": 44,
        "Date_of_birth": "1979-04-07",
        "Photo": "NULL",
        "Occupation": "architect",
        "Traits": "- I often withhold my opinions to avoid upsetting others. - In chaotic or unstable environments, I often feel lost and overwhelmed. - I enjoy the thrill of surprises, and the sensation of excitement can be addictive to me. - I care about what others think, so I must put on makeup before going out with friends. - I believe that rituals are essential for love. - Sometimes I’m indulging in dating. - Collaborating with others toward a common goal is fulfilling for me. - In conflicts, I actively work to de-escalate tensions. - I like to imagine myself in adventurous scenarios. - The unknown aspects of space intrigue me. - I lean towards idealism. - A few friends think I have some philosophical ideas. - My decisions are often influenced by intuition. - People see me as moderately disorganized. - My goals are vague and not very well-defined. - Finding connections between concepts is not my strength. - Concentrating on deep thoughts is challenging. - The idea of making sweeping changes or imposing order is daunting to me. - Social experiments and pranks are outside my comfort zone. - I avoid taking the lead in discussions. ",
        "Hobbies": "playing video games, running, skateboarding",
        "Family": "high-income, extended family",
        "Education": "have earned a master's degree",
        "Short-term_goals": "reading certain books, building relationships with superiors, learning a new language",
        "Long-term_goal": "visiting specific landmarks"
    },
{
        "ID": "009",
        "Gender": "male",
        "Name": "Leslie Nichols",
        "Age": 27,
        "Date_of_birth": "1996-05-05",
        "Photo": "NULL",
        "Occupation": "early childhood teacher",
        "Traits": "- I have had many partners and tend to fall in love easily. - I believe that rituals are essential for love. - I value material pleasures and enjoy sharing these feelings with others. - I enjoy things that stimulate my senses, like horror movies or riding roller coasters. - I often take a leading role in discussions and brainstorming. - I am capable of focusing on and managing crises effectively. - I have a strong desire to make things more logical and efficient. - I enjoy imagining the opportunities hidden behind dangers. - I occasionally think about unusual possibilities. - Some friends think I have philosophical tendencies. - I hold a few stereotypes but am open to learning. - My attempts at humor do not always lift the mood. - I have some sympathy for animals in hard situations, but it is limited. - My goals are vague and not very well-defined. - Concentrating on deep thoughts is challenging. - I struggle to maintain a consistent set of beliefs or logic. - I tend to express my emotions without reservation, sometimes sharing personal feelings impulsively, which can lead to blurred boundaries or inappropriate intimacy. - My personal beliefs are unclear and easily swayed. - I easily form friendships and sometimes too hastily accept new friends. - Finding meaning in life is a concept I find hard to grasp.",
        "Hobbies": "playing football, woodworking, playing video games",
        "Family": "middle-income, single-parent family",
        "Education": "have earned a professional degree",
        "Short-term_goals": "obtaining a certification, implementing a new time management strategy, volunteering",
        "Long-term_goal": "fostering new meaningful friendships"
    },
    {
        "ID": "010",
        "Gender": "male",
        "Name": "Robert Scott",
        "Age": 48,
        "Date_of_birth": "1975-09-22",
        "Photo": "NULL",
        "Occupation": "crop grower",
        "Traits": "- I prefer to rely on my own logical reasoning rather than following popular opinions. - I always pretend to be a superhero. - My fellows tend to praise my creative ideas. - I imagined raising a unicorn as a pet when I was a child. - I have an imaginary world in my brain. - I have clear goals that I am dedicated to. - I am skilled at finding patterns and connections in various contexts. - I frequently rely on the guidance of experience. - Listening to music gives me a peaceful feeling. - I aim to be a dependable person in my social circle. - Rituals in relationships are of little importance to me. - Empathy for others' troubles does not come naturally to me. - I am willing to make new friends, but I prefer to gradually deepen these relationships. - I seldom take the lead in group discussions. - I am not interested in playing pranks or conducting social experiments. - In emergency situations, I struggle with organizing my thoughts and can quickly become overwhelmed. - I hardly ever feel inspired by intangible concepts. - I struggle to find deeper meanings in things. - Visuals are less informative to me than clear text. - Symbolism in art and literature usually goes unnoticed.",
        "Hobbies": "playing guitar, martial arts, dancing",
        "Family": "high-income, blended family",
        "Education": "have earned a professional degree",
        "Short-term_goals": "volunteering, attending networking events, completing minor home improvement projects",
        "Long-term_goal": "taking on a leadership role in community organizations"
    },
    {
        "ID": "000",
        "Gender": "female",
        "Name": "Tianqi Zhang",
        "Age": 20,
        "Date_of_birth": "2003-05-24",
        "Photo": "NULL",
        "Occupation": "student",
        "Traits": "- I am bored of repetitive work. - I am open to different ideas. - My fellows tend to praise my creative ideas. - I always pretend to be a superhero. - In conflicts, I actively work to de-escalate tensions. - I quickly notice when someone close to me is upset. - I aim to be a supportive and dependable friend. - I am known for being reflective. - I am intrigued by abstract concepts. - Teaching others can be enjoyable. - I sometimes find interesting connections in my surroundings. - I have some idealistic thoughts but they are overshadowed by realism. - I listen to friends, but I am not fully engaged. - Parties and large social gatherings do not interest me. - I struggle to understand people's emotions through their facial expressions. - I am not prone to falling in love or having many romantic partners. - I am drawn to highly active and social environments like competitive team sports or large parties. - Music and concerts do not bring me harmony. - As a child, self-discipline and rule-following were not my strengths. - My memory of nostalgic events is not particularly strong.",
        "Hobbies": "making hell jokes, doing sports, listening to curious stories",
        "Family": "middle-income, nuclear family",
        "Education": "have earned a high school degree",
        "Short-term_goals": "trying the latest video game, having more sense of humor, throwing parties",
        "Long-term_goal": "being a psychological counselor to help others"
    }
]
