[
    {
        "ID": "001",
        "Name": "Mary Jones",
        "Personality_traits": "- I am a fan of extreme sports. - I like throwing parties and inviting all my friends. - I can tell someone's emotions by looking at their face. - I have had many partners and tend to fall in love easily. - My focus on logic sometimes makes me appear detached or overly critical to others. - I have a strong personal logic and set of beliefs. - I have clear goals that I am dedicated to. - It takes time for me to consider someone a friend. - My emotions are sometimes kept inside, especially if I am unsure about them. - I can be introspective, though not always. - Social experiments intrigue me, but I do not engage in them often. - My decisions are often influenced by intuition. - Punctuality for school was not my strong suit. - My ideas are usually conventional. - I seldom imagine being in different realities. - New ideas often seem impractical to me. - Comforting others is difficult and often avoided. - I find collaborative work unenjoyable and prefer solitude. - I lack empathy for animals used in experiments. - I do not place much value on forming close relationships. ",
        "Basic_infos": "\"\"\nName: Mary Jones, Age: 29, Gender: female, Date of Birth: 1994-06-27, Occupation: forestry worker, Hobbies: 'gardening, rock climbing, birdwatching', Family: low-income, nuclear family, Education: have not attended any formal schooling, Short-term Goals: 'volunteering, spending quality time with loved ones, adopting a balanced diet', Long-term Goal: buying a home.\n\"\"\n",
        "Extra": {},
        "Content": "Mary Jones was born on June 27, 1994, into a low-income nuclear family in East Town. Growing up, Mary did not have the opportunity to attend formal schooling, but that did not deter her from pursuing her dreams. Despite the challenges she faced, Mary developed a strong sense of personal logic and a set of beliefs that guided her throughout her life.\n\nAs a child, Mary discovered her love for nature and spent most of her time exploring the outdoors. She developed a deep connection with the environment and knew from an early age that she wanted to work in a field that allowed her to protect and preserve it. This passion for nature led her to become a forestry worker, where she could actively contribute to the conservation efforts in her community.\n\nMary's personality traits, including her love for extreme sports and her ability to read emotions, shaped her interactions with others. She enjoyed the thrill of rock climbing and found solace in birdwatching, immersing herself in the beauty of the natural world. Her ability to understand people's emotions by simply looking at their faces helped her form meaningful connections with those around her.\n\nDespite her strong sense of individuality, Mary recognized the importance of community and valued spending quality time with her loved ones. She set short-term goals for herself, such as volunteering and adopting a balanced diet, to enhance her personal growth and well-being. These goals allowed her to give back to her community and prioritize her physical and mental health.\n\nLooking towards the future, Mary's long-term goal was to buy a home. She dreamed of having a place to call her own, where she could create a sanctuary that reflected her love for nature and provided a sense of stability. This aspiration motivated her to work hard and save diligently, ensuring that she could achieve her dream in due time.\n\nThroughout her life, Mary's unconventional path and strong sense of self guided her journey. Her lack of formal education did not hinder her success as she found fulfillment in her chosen profession. Mary's dedication to preserving the environment and her commitment to personal growth made her an inspiration to those around her. As she continued to navigate life, Mary remained true to herself, embracing her unique personality traits and pursuing her dreams with unwavering determination."
    },
    {
        "ID": "002",
        "Name": "Sara Ochoa",
        "Personality_traits": "- My unique ideas were born from inspiration. - My friends say I am a philosopher. - I like something that has a symbolic meaning. - Others always think I am contemplating. - I prefer to rely on my own logical reasoning rather than following popular opinions. - My focus on logic sometimes makes me appear detached or overly critical to others. - When faced with opportunities, I emphasize fairness and reasonableness over compassion. - I often use examples to illustrate my points. - I defend my opinions and sometimes challenge others’ views. - During disagreements, I try to smooth things over. - Sometimes beautiful landscapes can evoke a sense of romance in me. - I rarely fantasize about unreal scenarios. - I am cautious about new ideas and often stick to what I know and have experienced. - Sensory experiences like horror movies or roller coasters do not attract me. - Romantic rituals seem unnecessary to me. - The opinions of others about my appearance do not concern me much. - I often find myself stereotyping, despite efforts to avoid it. - I rarely schedule my daily activities. - My memory of nostalgic events is not particularly strong. - I am drawn to highly active and social environments like competitive team sports or large parties.",
        "Basic_infos": "\"\"\nName: Sara Ochoa, Age: 44, Gender: female, Date of Birth: 1979-09-11, Occupation: metal processing operator, Hobbies: 'watching movies, camping, swimming', Family: low-income, blended family, Education: have completed high school, Short-term Goals: 'taking time for hobbies, learning a new skill related to the job, spending quality time with loved ones', Long-term Goal: saving enough to retire comfortably.\n\"\"\n",
        "Extra": {},
        "Content": "Sara Ochoa was born on September 11, 1979, in East Town. Growing up in a low-income, blended family, Sara learned the value of hard work and perseverance from an early age. Despite the financial challenges her family faced, Sara always had a curious and philosophical mind.\n\nAs a child, Sara attended high school and developed a love for learning. She was known for her unique ideas and logical reasoning. Her friends often saw her as a philosopher, always contemplating the deeper meaning of things. Sara's focus on logic sometimes made her appear detached or overly critical, but she never hesitated to defend her opinions and challenge others' views.\n\nThroughout her teenage years, Sara continued to explore her hobbies. She found solace in watching movies, immersing herself in different stories and characters. Besides, camping and swimming became her favorite outdoor activities, allowing her to connect with nature and find peace in the simplicity of the natural world.\n\nAfter completing her education, Sara embarked on her career as a metal processing operator. Her attention to detail and logical thinking made her excel in her job. However, she always felt the need to learn and grow, so she set short-term goals for herself. She dedicated time to her hobbies, ensuring she had a healthy work-life balance. Sara also aimed to learn a new skill related to her job, constantly seeking to improve and stay relevant in her field.\n\nFamily has always been important to Sara. Despite the challenges she faced, she cherished the moments she spent with her loved ones. Whether it was a simple dinner at home or a weekend getaway, Sara made it a priority to spend quality time with her family.\n\nLooking towards the future, Sara's long-term goal is to save enough to retire comfortably. She understands the importance of financial security and wants to ensure a stable and worry-free life in her later years. With her determination and strong work ethic, she is confident that she can achieve this goal.\n\nNow, at the age of 44, Sara continues to navigate through life with her unique perspective and unwavering dedication. She remains true to her logical reasoning and philosophical nature, finding inspiration in the world around her. Sara's love for movies, camping, and swimming still brings joy to her life, providing moments of relaxation and reflection.\n\nAs she moves forward, Sara remains focused on her short-term goals, taking time for her hobbies, learning new skills, and nurturing her relationships. With each passing day, she gets closer to her long-term goal of retiring comfortably, knowing that her hard work and determination will pay off in the end.\n\nSara Ochoa's life is a testament to the power of perseverance, curiosity, and the pursuit of personal growth. Her journey serves as an inspiration to those around her, reminding them that even in the face of adversity, one can find success and happiness by staying true to oneself."
    },
    {
        "ID": "003",
        "Name": "Tami Clark",
        "Personality_traits": "- I can tell someone's emotions by looking at their face. - I have had many partners and tend to fall in love easily. - I value material pleasures and enjoy sharing these feelings with others. - Sometimes I’m indulging in dating. - I am selective about making friends and value deep connections. - I prioritize my emotional well-being and try to stay comfortable. - My beliefs are strong, and I am seen as principled. - I get restless with routine work. - New perspectives are interesting to me. - When making decisions, I consider both compassion and fairness. - hunches are right about half the time. - My attempts at humor do not always lift the mood. - Social rules are somewhat important, but I do not always follow them. - I get easily influenced in debates. - I seldom take the lead in group discussions. - I struggle with using examples effectively. - I was frequently late for school. - My memory of nostalgic events is not particularly strong. - People often find me disorganized. - I almost entirely rely on intuition in my actions, rarely considering past experiences or established methods.",
        "Basic_infos": "\"\"\nName: Tami Clark, Age: 53, Gender: female, Date of Birth: 1970-08-18, Occupation: chef, Hobbies: 'listening to music, gymnastics, boating', Family: middle-income, extended family, Education: have attended college but have not earned a degree, Short-term Goals: 'planning short trips or outings, paying down debt, building relationships with superiors', Long-term Goal: traveling to new countries.\n\"\"\n",
        "Extra": {},
        "Content": "Tami Clark was born on August 18, 1970, in the vibrant town of East Town. From a young age, Tami exhibited an intuitive nature, relying on her instincts to guide her through life. Growing up in a middle-income family, Tami experienced the love and support of her extended family, who played an integral role in shaping her character.\n\nAs a child, Tami had a restless spirit, often finding herself daydreaming and seeking new experiences. This led to her frequently being late for school, as she struggled with the constraints of routine. Despite her tendency to challenge social norms, Tami valued deep connections and selectively made friends who shared her desire for meaningful relationships.\n\nIn her teenage years, Tami discovered her passion for cooking. With a natural talent for creating delicious dishes, she decided to pursue a career as a chef. Although she attended college, Tami did not earn a degree, opting instead to focus on gaining practical experience in the culinary world.\n\nThroughout her adult life, Tami's personality traits continued to shape her experiences. Her strong beliefs and principled nature guided her decision-making process, always considering both compassion and fairness. Tami's ability to read people's emotions by simply looking at their faces allowed her to connect with others on a deeper level, making her a sought-after confidante and friend.\n\nTami's love life was marked by a series of passionate relationships. She fell in love easily and enjoyed indulging in the pleasures of dating. However, her attempts at humor didn't always have the desired effect, and she learned that not everyone shared her sense of humor.\n\nIn her early 50s, Tami found herself reflecting on her life and setting new goals. She realized the importance of prioritizing her emotional well-being and sought comfort and stability. Tami's short-term goals included planning short trips or outings to rejuvenate her spirit, paying down debt to achieve financial freedom, and building relationships with her superiors in the culinary industry to further her career.\n\nLooking towards the future, Tami's long-term goal was to travel to new countries. With her adventurous spirit and love for exploring new perspectives, she yearned to immerse herself in different cultures and broaden her horizons.\n\nThroughout her journey, Tami remained true to herself, embracing her intuitive nature and valuing the connections she made with others. As a chef, she continued to delight people with her culinary creations, infusing her dishes with the same passion and creativity that defined her life.\n\nTami Clark's life has been a testament to the power of intuition, deep connections, and the pursuit of one's passions. Her story serves as an inspiration to all those who dare to follow their instincts and live life to the fullest."
    },
    {
        "ID": "004",
        "Name": "Michael Miller",
        "Personality_traits": "- Fearing to hurt others' feelings, I often conceal my thoughts and refrain from persuading others. - Listening to a concert brings me peace and harmony. - I avoid debating or critiquing others’ opinions. - I have a good memory because I am nostalgic. - I heavily rely on past experiences. - I usually order the same meal for lunch. - I often wonder how others perceive me. - I maintain an idealistic view of the world. - I am selective about making friends and value deep connections. - I try to mediate during arguments to bring about peace. - I have a good sense of humor and can make social gatherings enjoyable. - Some of my ideas are innovative. - I can focus well, though I am occasionally distracted. - Symbolism in art and literature is often lost on me. - I seldom indulge in self-reflection regarding my thoughts and emotions. - I am indifferent to material pleasures. - I rarely engage in dating. - I avoid adventure sports and similar activities. - In chaotic or unstable environments, I often feel lost and overwhelmed. - I avoid taking the lead in discussions.",
        "Basic_infos": "\"\"\nName: Michael Miller, Age: 25, Gender: male, Date of Birth: 1998-07-09, Occupation: tourist guide, Hobbies: 'photography, gardening, running', Family: low-income, single-parent family, Education: have earned a bachelor's degree, Short-term Goals: 'creating a daily schedule, completing minor home improvement projects, joining professional organizations', Long-term Goal: engaging in regular volunteer work.\n\"\"\n",
        "Extra": {},
        "Content": "Michael Miller was born on July 9, 1998, in East Town. Growing up in a low-income, single-parent family, Michael learned the value of hard work and perseverance from an early age. Despite the financial challenges, his family always emphasized the importance of education.\n\nAs a child, Michael showed a keen interest in photography. He would often borrow his mother's old camera and capture the beauty of everyday life in East Town. This hobby sparked his creativity and allowed him to see the world from a unique perspective.\n\nIn school, Michael excelled academically. He had a good memory and relied heavily on past experiences to understand new concepts. This helped him earn a bachelor's degree, a significant achievement considering the circumstances he grew up in.\n\nAfter completing his education, Michael decided to pursue a career as a tourist guide. His love for photography and his deep knowledge of East Town made him the perfect candidate for the job. He enjoyed sharing the history and culture of his hometown with visitors from around the world.\n\nOutside of work, Michael found solace in gardening. Tending to plants and watching them grow brought him a sense of peace and fulfillment. It was a way for him to connect with nature and find balance in his busy life.\n\nIn his free time, Michael enjoyed running. It was a way for him to stay fit and clear his mind. He found joy in pushing his limits and challenging himself to go further each time.\n\nAs Michael entered his mid-twenties, he began to contemplate his future and set goals for himself. He wanted to create a daily schedule to better manage his time and increase his productivity. He also had plans to complete minor home improvement projects to create a more comfortable living space.\n\nAdditionally, Michael aimed to join professional organizations related to his field. He believed that networking and learning from others in the industry would help him grow both personally and professionally.\n\nLooking ahead, Michael had a long-term goal of engaging in regular volunteer work. He wanted to give back to his community and make a positive impact on the lives of others. Whether it was helping at a local shelter or participating in environmental initiatives, he believed that small acts of kindness could make a big difference.\n\nIn summary, Michael Miller's life has been shaped by his humble beginnings and his determination to succeed. His passion for photography, gardening, and running has brought him joy and helped him find balance. With his short-term goals of creating a daily schedule, completing home improvement projects, and joining professional organizations, he is actively working towards a better future. And with his long-term goal of engaging in regular volunteer work, he hopes to make a positive impact on the world around him."
    },
    {
        "ID": "005",
        "Name": "Haley Collins",
        "Personality_traits": "- I usually order the same meal for lunch. - I make a schedule for everyday tasks. - I have a good memory because I am nostalgic. - I enjoy relaxing activities that allow for solitary immersion. - Teaching and sharing knowledge is something I find fulfilling. - I have a strong desire to make things more logical and efficient. - In debates, I am able to maintain focus and point out flaws in arguments. - I get restless with routine work. - The unknown aspects of space intrigue me. - I can be perceived as somewhat critical, though I try to balance logic with emotion. - I am cautious about surprises and tend to favor situations where I am informed. - I try to comfort people, but I am not always sure what to say. - I sometimes voice opinions that might upset others. - Visuals do not convey much meaning to me. - I usually overlook deeper meanings. - I prefer stories with clear endings. - My feelings often take a backseat to more immediate concerns. - I easily form friendships and sometimes too hastily accept new friends. - I rarely think about how others see me. - Being a listener is challenging, and I am not effective at it.",
        "Basic_infos": "\"\"\nName: Haley Collins, Age: 46, Gender: female, Date of Birth: 1977-09-21, Occupation: electrical equipment repairer, Hobbies: 'playing football, astronomy, singing', Family: middle-income, single-parent family, Education: have earned a professional degree, Short-term Goals: 'practicing relaxation techniques like meditation or yoga, supporting local businesses and events, volunteering', Long-term Goal: taking on a leadership role in community organizations.\n\"\"\n",
        "Extra": {},
        "Content": "Haley Collins was born on September 21, 1977, in East Town, into a middle-income, single-parent family. From a young age, she displayed a strong sense of nostalgia and an excellent memory. Haley enjoyed routine and would often order the same meal for lunch. Her cautious nature made her prefer situations where she was well-informed and not taken by surprise.\n\nAs Haley grew older, she discovered her passion for fixing things. After earning a professional degree, she pursued a career as an electrical equipment repairer. Her logical and efficient approach to work made her highly sought after in her field. However, she occasionally felt restless with routine tasks and longed for something more intellectually stimulating.\n\nIn her free time, Haley found solace in playing football, indulging in her love for astronomy, and singing. These hobbies allowed her to relax and immerse herself in solitary activities. Haley also had a keen interest in the unknown aspects of space, finding the mysteries of the universe intriguing.\n\nAs she entered her forties, Haley decided to focus on personal growth and self-improvement. She set short-term goals for herself, such as practicing relaxation techniques like meditation or yoga, supporting local businesses and events, and volunteering in her community. These activities brought her a sense of fulfillment and allowed her to connect with others on a deeper level.\n\nLooking towards the future, Haley's long-term goal is to take on a leadership role in community organizations. She believes that by actively participating in her community, she can make a positive impact and contribute to the betterment of society.\n\nThroughout her life, Haley has exhibited a unique blend of logical thinking and a desire to comfort others. While she may sometimes voice opinions that could upset others, she strives to balance logic with emotion. Haley's ability to maintain focus and point out flaws in arguments has made her a valuable asset in debates.\n\nDespite occasionally struggling with being an effective listener, Haley easily forms friendships and accepts new friends into her life. She rarely thinks about how others perceive her and remains true to herself.\n\nIn summary, Haley Collins has led a life centered around her love for fixing things, her passion for astronomy, and her desire to make a positive impact in her community. With her logical and efficient approach to work and her ability to connect with others, Haley continues to navigate through life with a strong sense of purpose and determination."
    },
    {
        "ID": "006",
        "Name": "James Jones",
        "Personality_traits": "- I often hide my feelings due to shyness or uncertainty. - In emergency situations, I struggle with organizing my thoughts and can quickly become overwhelmed. - Although there is a routine, I am eager to explore a new way. - I am bored of repetitive work. - I have an imaginary world in my brain. - People think I am a weirdo because my thoughts are too jumpy. - I empathize with my friends' problems. - I often wonder how others perceive me. - I feel sympathy for animals used in research. - I have a good sense of humor and can make social gatherings enjoyable. - Some friends think I have philosophical tendencies. - Mildly adventurous activities are sometimes interesting. - I have goals but they are not always clear or strong. - I am not always open to viewpoints that differ from mine. - I seldom take the lead in group discussions. - I get easily influenced in debates. - As a child, self-discipline and rule-following were not my strengths. - Music and concerts do not bring me harmony. - I almost entirely rely on intuition in my actions, rarely considering past experiences or established methods. - I often find myself stereotyping, despite efforts to avoid it.",
        "Basic_infos": "\"\"\nName: James Jones, Age: 35, Gender: male, Date of Birth: 1988-09-13, Occupation: van driver, Hobbies: 'fishing, watching movies, horseback riding', Family: low-income, nuclear family, Education: have completed high school, Short-term Goals: 'engaging in regular exercise, implementing a new time management strategy, saving a certain amount of money', Long-term Goal: paying off the mortgage.\n\"\"\n",
        "Extra": {},
        "Content": "James Jones was born on September 13, 1988, in a small town called East Town. Growing up in a low-income, nuclear family, James faced various challenges that shaped his character. As a child, he displayed a lack of self-discipline and struggled to follow rules. Despite these early difficulties, James completed his high school education.\n\nAs he entered adulthood, James found himself drawn to unconventional pursuits. He became a van driver, a job that provided him with a sense of freedom and allowed him to explore new places. However, the repetitive nature of the work soon left him feeling bored and unfulfilled. James craved something more, an escape from the monotony of his daily routine.\n\nIn his free time, James found solace in his hobbies. He enjoyed fishing, finding peace and tranquility in the stillness of nature. Movies also became a source of entertainment and inspiration for him, transporting him to different worlds and sparking his imagination. Occasionally, he would indulge in the thrill of horseback riding, embracing the adrenaline rush it provided.\n\nDespite his seemingly carefree nature, James possessed a deep empathy for others. He often found himself pondering how others perceived him and was sensitive to his friends' problems. His good sense of humor made social gatherings enjoyable, and some friends even recognized his philosophical tendencies. However, his shyness and uncertainty sometimes caused him to hide his true feelings.\n\nAs James grew older, he realized the importance of setting goals for himself. Engaging in regular exercise, implementing a new time management strategy, and saving a certain amount of money became his short-term aspirations. He recognized the need for structure and discipline in his life, and these goals served as a way to achieve that.\n\nLooking towards the future, James's long-term goal was to pay off his mortgage. This aspiration represented his desire for stability and financial security. He understood the importance of taking responsibility for his future and was determined to achieve this milestone.\n\nThroughout his life, James relied heavily on his intuition, often neglecting past experiences or established methods. This sometimes led to him stereotyping others, despite his efforts to avoid it. In emergency situations, he struggled with organizing his thoughts and became easily overwhelmed. However, James never shied away from embracing mild adventures, finding them intriguing and a way to break free from his routine.\n\nJames Jones's life has been a series of ups and downs, filled with self-discovery and the pursuit of personal growth. From his humble beginnings in East Town to his current occupation as a van driver, James has continuously sought to break free from the mundane and embrace new experiences. With his short-term goals guiding him and his long-term goal of paying off the mortgage in sight, James is determined to create a life filled with stability, adventure, and personal fulfillment."
    },
    {
        "ID": "007",
        "Name": "Kevin Kelly",
        "Personality_traits": "- I have a good memory because I am nostalgic. - I usually order the same meal for lunch. - I heavily rely on past experiences. - As a child, I was self-disciplined and always adhered to the school rules. - I have clear goals that I am dedicated to. - I am highly analytical, and often lost in my thoughts, which makes me appear distant to others. - When faced with opportunities, I emphasize fairness and reasonableness over compassion. - I might think some people miss the bigger picture. - I am known for being reflective. - Repetition can be tiresome. - I appreciate a sense of community, though I am fine on my own too. - I have opinions but do not often confront others' views. - I find it hard to take control in chaotic situations. - My idealism is limited, and I lean more towards pragmatism. - Defining meaning in life is a challenge for me. - Romantic associations with landscapes are infrequent for me. - Dating and romantic relationships are not priorities for me. - I am indifferent to others' perceptions of my appearance. - I am almost entirely uninterested in material pleasures. - I do not believe in the significance of rituals in love.",
        "Basic_infos": "\"\"\nName: Kevin Kelly, Age: 36, Gender: male, Date of Birth: 1988-05-29, Occupation: software developer, Hobbies: 'reading, yoga, metalworking', Family: low-income, blended family, Education: have earned a bachelor's degree, Short-term Goals: 'learning a new skill related to the job, completing minor home improvement projects, planning short trips or outings', Long-term Goal: earning a promotion.\n\"\"\n",
        "Extra": {},
        "Content": "Kevin Kelly was born on May 29, 1988, in the small town of East Town. Growing up in a low-income, blended family, Kevin learned the value of hard work and perseverance from an early age. As a child, he was known for his self-discipline and adherence to rules, traits that would shape his future.\n\nKevin excelled in school, utilizing his good memory and reliance on past experiences to achieve success. After completing high school, Kevin pursued higher education and earned a bachelor's degree.\n\nFollowing his graduation, Kevin embarked on a career path as a software developer. His highly analytical nature and penchant for getting lost in his thoughts made him a natural fit for the field. Kevin's dedication to his work and clear goals propelled him forward, as he constantly sought to expand his skill set and stay updated with the latest industry trends.\n\nOutside of his professional life, Kevin found solace in his hobbies. Reading became a cherished pastime, allowing him to explore new worlds and expand his horizons. Yoga provided him with a sense of tranquility, helping him find peace amidst the chaos of everyday life. Additionally, Kevin discovered a passion for metalworking, using his creativity and attention to detail to craft unique pieces of art.\n\nWhile Kevin focused on his personal and professional growth, he also valued his relationships with others. Despite his introspective nature, he appreciated a sense of community and found comfort in the company of others. However, Kevin's idealism was limited, and he leaned more towards pragmatism, often prioritizing fairness and reasonableness over compassion.\n\nIn terms of his long-term goals, Kevin aspired to earn a promotion in his career. He understood the importance of continuous improvement and was determined to climb the ladder of success. To achieve this, he set several short-term goals such as learning new skills related to his job, completing minor home improvement projects, and planning short trips or outings to maintain a healthy work-life balance.\n\nThroughout his life, Kevin remained indifferent to others' perceptions of his appearance and material pleasures. He found little significance in rituals associated with love and relationships, choosing to prioritize personal growth and self-improvement instead.\n\nAs Kevin continues to navigate through life, his reflective nature and pragmatic mindset will guide him towards achieving his long-term goal: earning a promotion. With his dedication, analytical prowess, and commitment to personal growth, Kevin is poised for success in both his personal and professional endeavors."
    },
    {
        "ID": "008",
        "Name": "Erica Walker",
        "Personality_traits": "- I often withhold my opinions to avoid upsetting others. - In chaotic or unstable environments, I often feel lost and overwhelmed. - I enjoy the thrill of surprises, and the sensation of excitement can be addictive to me. - I care about what others think, so I must put on makeup before going out with friends. - I believe that rituals are essential for love. - Sometimes I’m indulging in dating. - Collaborating with others toward a common goal is fulfilling for me. - In conflicts, I actively work to de-escalate tensions. - I like to imagine myself in adventurous scenarios. - The unknown aspects of space intrigue me. - I lean towards idealism. - A few friends think I have some philosophical ideas. - My decisions are often influenced by intuition. - People see me as moderately disorganized. - My goals are vague and not very well-defined. - Finding connections between concepts is not my strength. - Concentrating on deep thoughts is challenging. - The idea of making sweeping changes or imposing order is daunting to me. - Social experiments and pranks are outside my comfort zone. - I avoid taking the lead in discussions. ",
        "Basic_infos": "\"\"\nName: Erica Walker, Age: 44, Gender: female, Date of Birth: 1979-04-07, Occupation: architect, Hobbies: 'playing video games, running, skateboarding', Family: high-income, extended family, Education: have earned a master's degree, Short-term Goals: 'reading certain books, building relationships with superiors, learning a new language', Long-term Goal: visiting specific landmarks.\n\"\"\n",
        "Extra": {},
        "Content": "Erica Walker was born on April 7, 1979, in East Town, to a family of high-income and with an extended family network. From a young age, Erica displayed a curious and adventurous spirit, always seeking the thrill of surprises and the excitement of the unknown.\n\nAs she grew older, Erica's passion for architecture began to take shape. She excelled in her studies and went on to earn a master's degree in architecture. With her education complete, Erica embarked on her career as an architect, where she found fulfillment in collaborating with others towards a common goal.\n\nIn her personal life, Erica enjoyed playing video games, finding solace and entertainment in the virtual worlds. She also had a love for physical activities, such as running and skateboarding, which allowed her to embrace her active and adventurous side.\n\nDespite her outgoing nature, Erica was known to care deeply about what others thought of her. Before going out with friends, she would meticulously put on makeup, believing that rituals were essential for love and social acceptance. Erica's desire to please others often led her to withhold her opinions, avoiding conflict and prioritizing harmony in her relationships.\n\nAs the years went by, Erica realized that her life goals were vague and not well-defined. She found it challenging to concentrate on deep thoughts and struggled to find connections between concepts. In chaotic or unstable environments, she often felt lost and overwhelmed, making sweeping changes or imposing order a daunting task for her.\n\nCurrently, at the age of 44, Erica's short-term goals include reading certain books to expand her knowledge, building stronger relationships with her superiors to advance her career, and learning a new language to broaden her horizons.\n\nLooking towards the future, Erica's long-term goal is to visit specific landmarks that have always intrigued her. She yearns to experience the awe-inspiring beauty of these places firsthand and satisfy her adventurous spirit.\n\nThroughout her life, Erica Walker has embraced the balance between her love for architecture, her passion for adventure, and her desire for social acceptance. Her journey has been one of self-discovery, growth, and the pursuit of fulfilling her dreams."
    },
    {
        "ID": "009",
        "Name": "Leslie Nichols",
        "Personality_traits": "- I have had many partners and tend to fall in love easily. - I believe that rituals are essential for love. - I value material pleasures and enjoy sharing these feelings with others. - I enjoy things that stimulate my senses, like horror movies or riding roller coasters. - I often take a leading role in discussions and brainstorming. - I am capable of focusing on and managing crises effectively. - I have a strong desire to make things more logical and efficient. - I enjoy imagining the opportunities hidden behind dangers. - I occasionally think about unusual possibilities. - Some friends think I have philosophical tendencies. - I hold a few stereotypes but am open to learning. - My attempts at humor do not always lift the mood. - I have some sympathy for animals in hard situations, but it is limited. - My goals are vague and not very well-defined. - Concentrating on deep thoughts is challenging. - I struggle to maintain a consistent set of beliefs or logic. - I tend to express my emotions without reservation, sometimes sharing personal feelings impulsively, which can lead to blurred boundaries or inappropriate intimacy. - My personal beliefs are unclear and easily swayed. - I easily form friendships and sometimes too hastily accept new friends. - Finding meaning in life is a concept I find hard to grasp.",
        "Basic_infos": "\"\"\nName: Leslie Nichols, Age: 27, Gender: male, Date of Birth: 1996-05-05, Occupation: early childhood teacher, Hobbies: 'playing football, woodworking, playing video games', Family: middle-income, single-parent family, Education: have earned a professional degree, Short-term Goals: 'obtaining a certification, implementing a new time management strategy, volunteering', Long-term Goal: fostering new meaningful friendships.\n\"\"\n",
        "Extra": {},
        "Content": "Leslie Nichols was born on May 5, 1996, into a middle-income, single-parent family in East Town. From a young age, Leslie displayed a curious and adventurous nature, always seeking new experiences and challenges. Growing up, Leslie had a love for playing football, spending hours on the field honing his skills and enjoying the camaraderie of his teammates.\n\nAs Leslie entered his teenage years, he discovered a passion for woodworking. Spending countless hours in his family's garage, he would create beautiful pieces of furniture and intricate designs. This hobby not only allowed him to express his creativity but also taught him patience and attention to detail.\n\nAfter completing his high school education, Leslie pursued a professional degree in early childhood education. He had always felt a natural attraction for working with children and wanted to make a positive impact on their lives. Leslie's dedication and hard work paid off, and he graduated with honors, ready to embark on his career as an early childhood teacher.\n\nIn his early twenties, Leslie found himself drawn to the world of video games. He would spend his free time exploring virtual worlds, competing with friends, and immersing himself in captivating storylines. This hobby provided him with an escape from the demands of his work and allowed him to unwind and recharge.\n\nAs Leslie entered his late twenties, he realized the importance of personal growth and development. He set short-term goals for himself, including obtaining a certification in early childhood education to enhance his professional skills. Leslie also recognized the need to improve his time management and began implementing a new strategy to maximize productivity and efficiency in both his personal and professional life.\n\nDriven by a desire to give back to his community, Leslie decided to volunteer his time and expertise at a local organization that supports underprivileged children. This opportunity allowed him to make a meaningful impact on the lives of those in need.\n\nLooking towards the future, Leslie's long-term goal is to foster new and meaningful friendships. He recognizes the value of genuine connections and hopes to surround himself with individuals who share his values and aspirations. Leslie believes that through these friendships, he can continue to learn and grow as a person, finding purpose and fulfillment in his life.\n\nThroughout his journey, Leslie has remained true to his adventurous and compassionate nature. From his love for football and woodworking to his dedication to early childhood education and volunteer work, Leslie has embraced every opportunity to make a positive impact on the world around him. As he continues to pursue his goals and forge new friendships, Leslie's story is one of growth, resilience, and a steadfast commitment to making a difference in the lives of others."
    },
    {
        "ID": "010",
        "Name": "Robert Scott",
        "Personality_traits": "- I prefer to rely on my own logical reasoning rather than following popular opinions. - I always pretend to be a superhero. - My fellows tend to praise my creative ideas. - I imagined raising a unicorn as a pet when I was a child. - I have an imaginary world in my brain. - I have clear goals that I am dedicated to. - I am skilled at finding patterns and connections in various contexts. - I frequently rely on the guidance of experience. - Listening to music gives me a peaceful feeling. - I aim to be a dependable person in my social circle. - Rituals in relationships are of little importance to me. - Empathy for others' troubles does not come naturally to me. - I am willing to make new friends, but I prefer to gradually deepen these relationships. - I seldom take the lead in group discussions. - I am not interested in playing pranks or conducting social experiments. - In emergency situations, I struggle with organizing my thoughts and can quickly become overwhelmed. - I hardly ever feel inspired by intangible concepts. - I struggle to find deeper meanings in things. - Visuals are less informative to me than clear text. - Symbolism in art and literature usually goes unnoticed.",
        "Basic_infos": "\"\"\nName: Robert Scott, Age: 48, Gender: male, Date of Birth: 1975-09-22, Occupation: crop grower, Hobbies: 'playing guitar, martial arts, dancing', Family: high-income, blended family, Education: have earned a professional degree, Short-term Goals: 'volunteering, attending networking events, completing minor home improvement projects', Long-term Goal: taking on a leadership role in community organizations.\n\"\"\n",
        "Extra": {},
        "Content": "Robert Scott was born on September 22, 1975, in East Town to a high-income, blended family. From an early age, Robert displayed a vivid imagination and a creative thinking. He would often pretend to be a superhero and even dreamt of raising a unicorn as a pet. These imaginative tendencies shaped his personality and influenced his future endeavors.\n\nAs Robert grew older, he developed a strong inclination towards logical reasoning and independent thought. He preferred to rely on his own judgment rather than following popular opinions. This trait, coupled with his ability to find patterns and connections in various contexts, made him stand out among his peers.\n\nAfter completing his education and earning a professional degree, Robert pursued a career as a crop grower. His love for nature and his desire to contribute to the community led him to this occupation. He found solace in tending to his crops and witnessing the fruits of his labor.\n\nOutside of his work, Robert had a few hobbies that brought him joy and allowed him to express himself. He enjoyed playing the guitar, practicing martial arts, and dancing. These activities served as outlets for his creative energy and provided a sense of fulfillment.\n\nIn his personal life, Robert valued deep and meaningful relationships. While he was open to making new friends, he preferred to gradually deepen these connections over time. Rituals in relationships held little importance to him, as he believed in genuine and authentic interactions.\n\nCurrently, at the age of 48, Robert has set both short-term and long-term goals for himself. In the short term, he plans to dedicate his time to volunteering, attending networking events, and completing minor home improvement projects. These endeavors allow him to give back to the community and expand his social circle.\n\nLooking towards the future, Robert's long-term goal is to take on a leadership role in community organizations. He aspires to be a dependable and influential figure in his community, using his skills and experiences to make a positive impact on the lives of others.\n\nThroughout his life, Robert Scott has embraced his unique personality and pursued his passions with unwavering dedication. His journey has been one of self-discovery, growth, and a commitment to making a difference in the world around him."
    },
    {
        "ID": "000",
        "Name": "Marsh Zhaleh",
        "Personality_traits": "- I am bored of repetitive work. - I am open to different ideas. - My fellows tend to praise my creative ideas. - I always pretend to be a superhero. - In conflicts, I actively work to de-escalate tensions. - I quickly notice when someone close to me is upset. - I aim to be a supportive and dependable friend. - I am known for being reflective. - I am intrigued by abstract concepts. - Teaching others can be enjoyable. - I sometimes find interesting connections in my surroundings. - I have some idealistic thoughts but they are overshadowed by realism. - I listen to friends, but I am not fully engaged. - Parties and large social gatherings do not interest me. - I struggle to understand people's emotions through their facial expressions. - I am not prone to falling in love or having many romantic partners. - I am drawn to highly active and social environments like competitive team sports or large parties. - Music and concerts do not bring me harmony. - As a child, self-discipline and rule-following were not my strengths. - My memory of nostalgic events is not particularly strong.",
        "Basic_infos": "\"\"\nName: Marsh Zhaleh, Age: 20, Gender: female, Date of Birth: 2003-05-24, Occupation: student, Hobbies: 'making jokes, doing sports, listening to curious stories', Family: middle-income, nuclear family, Education: have earned a high school degree, Short-term Goals: 'trying the latest video game, having more sense of humor, throwing parties', Long-term Goal: being a psychological counselor to help others.\n\"\"\n",
        "Extra": {},
        "Content": "Marsh Zhaleh was born on May 24, 2003, in East Town. From a young age, Marsh displayed a unique and creative personality. She was always open to new ideas and had a knack for making people laugh with her witty sense of humor.\n\nGrowing up in a middle-income nuclear family, Marsh had a supportive environment that encouraged her to explore her interests. She attended school and excelled academically, earning a high school degree. Although self-discipline and rule-following were not her strengths as a child, Marsh's reflective nature and ability to make interesting connections in her surroundings set her apart from her peers.\n\nAs a teenager, Marsh developed a passion for sports and actively participated in various athletic activities. She found solace in the highly active and social environments of competitive team sports, which allowed her to channel her energy and connect with others on a different level. Through sports, Marsh learned the value of teamwork and the importance of supporting her teammates.\n\nWhile Marsh enjoyed sports, she also had a deep interest in the human mind. She found herself intrigued by abstract concepts and the inner workings of the human psyche. This fascination led her to dream of becoming a psychological counselor, hoping to help others navigate their emotions and find inner peace.\n\nCurrently, at the age of 20, Marsh is a student pursuing higher education. She is determined to broaden her horizons and gain a deeper understanding of the human mind. In her free time, she enjoys indulging in her hobbies, such as making dark humor jokes, engaging in sports activities, and listening to curious stories that expand her knowledge and perspective.\n\nIn the short term, Marsh's goals include trying the latest video games, further developing her sense of humor, and throwing parties to bring joy to those around her. These goals reflect her desire to continue exploring her interests and connecting with others in meaningful ways.\n\nLooking towards the future, Marsh's long-term goal remains steadfast – to become a psychological counselor. She envisions a career where she can utilize her unique blend of creativity, empathy, and analytical thinking to support and guide individuals through their personal journeys.\n\nTianqi Zhang's life is a testament to the power of embracing one's individuality and pursuing passions that bring joy and fulfillment. With her unwavering determination and natural inclination towards understanding the human mind, Marsh is well on her way to making a positive impact on the lives of others as a psychological counselor."
    }
]
